#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.docs_sync_service will be created
  + resource "google_cloud_run_service" "docs_sync_service" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = (sensitive value)
      + name                       = "docs-sync-service"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (sensitive value)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "ghcr.io/lobarr/docs-sync"

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # google_cloud_scheduler_job.docs_sync_job will be created
  + resource "google_cloud_scheduler_job" "docs_sync_job" {
      + description = "Run the docs-sync Cloud Run service every week"
      + id          = (known after apply)
      + name        = "docs-sync-job"
      + paused      = (known after apply)
      + project     = (known after apply)
      + region      = (known after apply)
      + schedule    = "0 0 * * 0"
      + state       = (known after apply)
      + time_zone   = "America/New_York"

      + http_target {
          + http_method = "POST"
          + uri         = (known after apply)
        }
    }

  # google_project_service.cloud_run will be created
  + resource "google_project_service" "cloud_run" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (sensitive value)
      + service            = "run.googleapis.com"
    }

  # google_project_service.cloud_scheduler will be created
  + resource "google_project_service" "cloud_scheduler" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (sensitive value)
      + service            = "cloudscheduler.googleapis.com"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloud_run_service_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

*Pusher: @Lobarr, Action: `pull_request`, Workflow: `workflow`*